# Str functions

In [2]:
import pandas as pd

In [3]:
s=pd.Series(["sanjay    ","****raisa###"," mahi=====","meenal8888","&&&&pari&&&&","rijwan+++sharik"])
s

0         sanjay
1       ****raisa###
2          mahi=====
3         meenal8888
4       &&&&pari&&&&
5    rijwan+++sharik
dtype: object

In [4]:
s.str.strip()

0             sanjay
1       ****raisa###
2          mahi=====
3         meenal8888
4       &&&&pari&&&&
5    rijwan+++sharik
dtype: object

In [9]:
s=s.str.strip(" *#=8&+")

In [10]:
s=s.str.replace("+","")

<ipython-input-10-4479ef1a587e>:1: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will*not* be treated as literal strings when regex=True.
  s=s.str.replace("+","")

In [11]:
s

0          sanjay
1           raisa
2            mahi
3          meenal
4            pari
5    rijwansharik
dtype: object

In [38]:
s1=s.str.replace('par','$')

In [39]:
s1

0          sanjay
1           raisa
2            mahi
3          meenal
4              $i
5    rijwansharik
dtype: object

In [57]:
h=pd.DataFrame(s1)
h

              0
0        sanjay
1         raisa
2          mahi
3        meenal
4            $i
5  rijwansharik

In [58]:
h[0]

0          sanjay
1           raisa
2            mahi
3          meenal
4              $i
5    rijwansharik
Name: 0, dtype: object

In [49]:
s=pd.DataFrame({'Name':s1})
s

           Name
0        sanjay
1         raisa
2          mahi
3        meenal
4            $i
5  rijwansharik

In [59]:
s['Name']

0          sanjay
1           raisa
2            mahi
3          meenal
4              $i
5    rijwansharik
Name: Name, dtype: object

In [60]:
s['Name'].str.strip('$')

0          sanjay
1           raisa
2            mahi
3          meenal
4               i
5    rijwansharik
Name: Name, dtype: object

In [63]:
s['Name'].str.endswith('i')

0    False
1    False
2     True
3    False
4     True
5    False
Name: Name, dtype: bool

In [65]:
s['Name'].str.upper()

0          SANJAY
1           RAISA
2            MAHI
3          MEENAL
4              $I
5    RIJWANSHARIK
Name: Name, dtype: object

In [66]:
a = pd.DataFrame({'Name':['A','B'],'Age':[23,44],'Place':['Pune','Kop']})
a

  Name  Age Place
0    A   23  Pune
1    B   44   Kop

In [69]:
#boolean Indexing
a.loc[:,[True,False,True]]

  Name Place
0    A  Pune
1    B   Kop

In [70]:
a.loc[[False,True],[True,False,True]]

#       row           column

  Name Place
1    B   Kop

In [71]:
a.loc[[True,True],[True,False,False]]

#       row           column

  Name
0    A
1    B